---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeSegment
source: html/1dc774c8-76c1-7b67-c1e7-c92dd4b8016b.htm
---
# RebarShapeSegment Properties

Specifies whether the .NET object represents a valid Revit entity.